@Ibrahim AbuAlhaol       [![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github.com/alhaol/psut-de/blob/main/ConnectToColab.ipynb)

Credit : [LINK](http://www.python-ds.com/python-processing-unstructured-data)

------

# Read Structured Data

Reading data from CSV(comma separated values) is a fundamental necessity in Data Science

In [8]:
import numpy as np
import pandas as pd

## Read CSV from file

In [15]:
URL='https://raw.githubusercontent.com/alhaol/psut-de/main/data/sampleset.csv'
DF=pd.read_csv(URL)
DF

   id      emp_name     emp_salary            start_date          dept
0   1    Vishavjeet         999.30            2018-12-04            IT
1   2        Nimesh         878.40            2017-09-24            IT
2   3          Sara         611.00            2014-11-15            HR
3   4        Gulfam         729.00            2014-05-11            IT
4   5          Jack         845.25            2016-07-27       Finance
5   6       Jessica         878.00            2014-05-21     Marketing
6   7        Saurav         632.80            2018-07-30    Operations
7   8        Sachin         722.50            2017-06-17           SEO

## Save DataFrame to csv

In [16]:
DF.to_csv('data/sampleset1.csv',index=False)

## Read CSV from file

In [17]:
DF_new=pd.read_csv('data/sampleset1.csv')

In [18]:
DF_new

   id      emp_name     emp_salary            start_date          dept
0   1    Vishavjeet         999.30            2018-12-04            IT
1   2        Nimesh         878.40            2017-09-24            IT
2   3          Sara         611.00            2014-11-15            HR
3   4        Gulfam         729.00            2014-05-11            IT
4   5          Jack         845.25            2016-07-27       Finance
5   6       Jessica         878.00            2014-05-21     Marketing
6   7        Saurav         632.80            2018-07-30    Operations
7   8        Sachin         722.50            2017-06-17           SEO

## Indexing DataFrames with Pandas

* DF.iloc[:5,:] — the first 5 rows, and all of the columns for those rows.
* DF.iloc[:,:] — the entire DataFrame.
* DF.iloc[5:,2:] — rows from position 5 onwards, and columns from position 2 onwards.
* DFDF.iloc[:,:2] — the first two columns, and all of the rows for the column.
* DFDF.iloc[6:,:] — from 6th row, and all of the columns for that row.

In [21]:
print('=========================================================')
print('The first 5 rows, and all of the columns for those rows.')
print(DF.iloc[:5,:]) 
print('=========================================================')
print('The entire DataFrame.')
print(DF.iloc[:,:]) 
print('=========================================================')
print('Rows from position 5 onwards, and columns from position 2 onwards.')
print(DF.iloc[5:,2:]) 
print('=========================================================')
print('The first column, and all of the rows for the column.')
print(DF.iloc[:,:2]) 
print('=========================================================')
print('From 6th row, and all of the columns for that row.')
print(DF.iloc[6:,:]) 
print('=========================================================')

=========================================================
The first 5 rows, and all of the columns for those rows.
   id      emp_name     emp_salary           start_date       dept
0   1    Vishavjeet         999.30           2018-12-04         IT
1   2        Nimesh         878.40           2017-09-24         IT
2   3          Sara         611.00           2014-11-15         HR
3   4        Gulfam         729.00           2014-05-11         IT
4   5          Jack         845.25           2016-07-27    Finance
=========================================================
The entire DataFrame.
   id      emp_name     emp_salary            start_date          dept
0   1    Vishavjeet         999.30            2018-12-04            IT
1   2        Nimesh         878.40            2017-09-24            IT
2   3          Sara         611.00            2014-11-15            HR
3   4        Gulfam         729.00            2014-05-11            IT
4   5          Jack         845.25            2016-07-27       Finance
5   6       Jessica         878.00            2014-05-21     Marketing
6   7        Saurav         632.80            2018-07-30    Operations
7   8        Sachin         722.50            2017-06-17           SEO
=========================================================
Rows from position 5 onwards, and columns from position 2 onwards.
      emp_salary            start_date          dept
5          878.0            2014-05-21     Marketing
6          632.8            2018-07-30    Operations
7          722.5            2017-06-17           SEO
=========================================================
The first column, and all of the rows for the column.
   id      emp_name
0   1    Vishavjeet
1   2        Nimesh
2   3          Sara
3   4        Gulfam
4   5          Jack
5   6       Jessica
6   7        Saurav
7   8        Sachin
=========================================================
From 6th row, and all of the columns for that row.
   id  emp_name     emp_salary          start_date          dept
6   7    Saurav          632.8          2018-07-30    Operations
7   8    Sachin          722.5          2017-06-17           SEO
=========================================================

# Read Semistructured Data

## Parse JSON - Convert from JSON to Python

In [22]:
import json
# some JSON:
x =  '{ "name":"Jessica", "age":28, "city":"New Delhi"}'
# parse x:
y = json.loads(x)
# the result is a Python dictionary:
print(y["age"])

28

In [23]:
# a Python object (dict):
x = {
  "name": "Jessica",
  "age": 30,
  "city": "New York"
}
# convert into JSON:
y = json.dumps(x)
# the result is a JSON string:
print(y)

{"name": "Jessica", "age": 30, "city": "New York"}

You can convert Python objects of the following types, into JSON strings:
- dict, 
- list, 
- tuple, 
- string, 
- int, 
- float, 
- True,
- False,
- None

In [24]:
import json
print(json.dumps({"name": "Jessica", "age": 30}))
print(json.dumps(["apple", "bananas"]))
print(json.dumps(("apple", "bananas")))
print(json.dumps("hello"))
print(json.dumps(42))
print(json.dumps(31.76))
print(json.dumps(True))
print(json.dumps(False))
print(json.dumps(None))

{"name": "Jessica", "age": 30}
["apple", "bananas"]
["apple", "bananas"]
"hello"
42
31.76
true
false
null

## Format the Result

In [25]:
 import json
x = {
  "name": "Jessica",
  "age": 30,
  "married": True,
  "divorced": False,
  "children": ("Ann","Billy"),
  "pets": None,
  "cars": [
    {"model": "BMW 230", "mpg": 27.5},
    {"model": "Ford Edge", "mpg": 24.1}
  ]
}
print(json.dumps(x))

{"name": "Jessica", "age": 30, "married": true, "divorced": false, "children": ["Ann", "Billy"], "pets": null, "cars": [{"model": "BMW 230", "mpg": 27.5}, {"model": "Ford Edge", "mpg": 24.1}]}

In [26]:
# use four indents to make it easier to read the result:
print(json.dumps(x, indent=4))

{
    "name": "Jessica",
    "age": 30,
    "married": true,
    "divorced": false,
    "children": [
        "Ann",
        "Billy"
    ],
    "pets": null,
    "cars": [
        {
            "model": "BMW 230",
            "mpg": 27.5
        },
        {
            "model": "Ford Edge",
            "mpg": 24.1
        }
    ]
}

In [28]:
# use . and a space to separate objects, and a space, a = and a space to separate keys from their values:
print(json.dumps(x, indent=4, separators=(". ", " = ")))

{
    "name" = "Jessica".
    "age" = 30.
    "married" = true.
    "divorced" = false.
    "children" = [
        "Ann".
        "Billy"
    ].
    "pets" = null.
    "cars" = [
        {
            "model" = "BMW 230".
            "mpg" = 27.5
        }.
        {
            "model" = "Ford Edge".
            "mpg" = 24.1
        }
    ]
}

In [29]:
# sort the result alphabetically by keys:
print(json.dumps(x, indent=4, sort_keys=True))

{
    "age": 30,
    "cars": [
        {
            "model": "BMW 230",
            "mpg": 27.5
        },
        {
            "model": "Ford Edge",
            "mpg": 24.1
        }
    ],
    "children": [
        "Ann",
        "Billy"
    ],
    "divorced": false,
    "married": true,
    "name": "Jessica",
    "pets": null
}

## Read json with Pandas

```json
{ 
   "ID":["1","2","3","4","5","6","7","8" ],
   "Name":["Vishavjeet","Amit","Nimesh","Sara","Saurav","Gulfam","Anupam","Guru" ],
   "Salary":["623.3","515.2","611","729","843.25","578","632.8","722.5" ],
   "StartDate":[ "1/1/2013","9/23/2014","11/15/2013","5/11/2014","3/27/2015","5/21/2013",
      "7/30/2013","6/17/2014"],
   "Dept":[ "IT","Operations","IT","HR","Finance","IT","Operations","Finance"]
}


```

In [31]:
URLJSON='https://raw.githubusercontent.com/alhaol/psut-de/main/data/input.json'
data = pd.read_json(URLJSON)
print (data)

   ID        Name  Salary   StartDate        Dept
0   1  Vishavjeet  623.30    1/1/2013          IT
1   2        Amit  515.20   9/23/2014  Operations
2   3      Nimesh  611.00  11/15/2013          IT
3   4        Sara  729.00   5/11/2014          HR
4   5      Saurav  843.25   3/27/2015     Finance
5   6      Gulfam  578.00   5/21/2013          IT
6   7      Anupam  632.80   7/30/2013  Operations
7   8        Guru  722.50   6/17/2014     Finance

In [33]:
#Reading Specific Columns and Rows
print (data.iloc[3:6,1:3])

     Name  Salary
3    Sara  729.00
4  Saurav  843.25
5  Gulfam  578.00

In [34]:
# to_json function  to read the JSON file content into individual records
print(data.to_json(orient='records', lines=True))

{"ID":1,"Name":"Vishavjeet","Salary":623.3,"StartDate":"1\/1\/2013","Dept":"IT"}
{"ID":2,"Name":"Amit","Salary":515.2,"StartDate":"9\/23\/2014","Dept":"Operations"}
{"ID":3,"Name":"Nimesh","Salary":611.0,"StartDate":"11\/15\/2013","Dept":"IT"}
{"ID":4,"Name":"Sara","Salary":729.0,"StartDate":"5\/11\/2014","Dept":"HR"}
{"ID":5,"Name":"Saurav","Salary":843.25,"StartDate":"3\/27\/2015","Dept":"Finance"}
{"ID":6,"Name":"Gulfam","Salary":578.0,"StartDate":"5\/21\/2013","Dept":"IT"}
{"ID":7,"Name":"Anupam","Salary":632.8,"StartDate":"7\/30\/2013","Dept":"Operations"}
{"ID":8,"Name":"Guru","Salary":722.5,"StartDate":"6\/17\/2014","Dept":"Finance"}

## Read Semistructured Data

In [35]:
URLTEXT='https://raw.githubusercontent.com/alhaol/psut-de/main/data/input_text.txt'

In [38]:
filename = URLTEXT 
with open(filename) as fn:  
# Read each line
   ln = fn.readline()
# Keep count of lines
   lncnt = 1
    while ln:
        print("Line {}: {}".format(lncnt, ln.strip()))
        ln = fn.readline()
        lncnt += 1

IndentationError: unexpected indent (<ipython-input-38-322e99e429eb>, line 7)

-----